Autodesk.Revit.DB.GroupNode.GetTransform
A transformation matrix associated with the node.
Since:
2014

Autodesk.Revit.DB.GroupNode.GetSymbolId
The Id of the symbol associated with the node.
Since:
2014

Autodesk.Revit.DB.GroupNode
A node that represents set of individual elements grouped together
in some form, such as an instance of a family or linked Revit file.
Since:
2014